Revit 2024 API
ExternallyTaggedGeometryValidation Members
The ExternallyTaggedGeometryValidation type exposes the following members.
Methods
Name | Description
IsNonSolid
 Makes sure that the input geometry object is not a Solid.
IsSolid
 Makes sure that the input geometry object is a Solid.
IsValidGeometry |  Obsolete.
 Validates the input geometry to be stored in an externally tagged geometry object. Valid types of geometry are: Solid, Mesh, GeometryInstance, Point and Curve.
LacksSubnodes
 Makes sure that the input geometry object does not have sub-nodes.
See Also
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace